{
  "weapons": [
    {
      "name": "Force Sword",
      "type": "Psychic Weapon",
      "class": "Psyker",
      "description": "A sword imbued with psychic energy that can cut through both physical matter and the warp essence of daemons."
    },
    {
      "name": "Force Staff",
      "type": "Psychic Weapon",
      "class": "Psyker",
      "description": "A staff that acts as a psychic focus, amplifying the psyker's abilities and allowing for more precise manipulation of the warp."
    },
    {
      "name": "Force Axe",
      "type": "Psychic Weapon",
      "class": "Psyker",
      "description": "A ceremonial axe that channels destructive psychic energy, capable of cleaving through heavy armor and daemon hide."
    },
    {
      "name": "Animus Speculum",
      "type": "Psychic Focus",
      "class": "Culexus Assassin",
      "description": "A device that channels the anti-psychic void of a Culexus Assassin into deadly energy beams powered by nearby psykers."
    },
    {
      "name": "Psychic Hood",
      "type": "Psychic Defense",
      "class": "Librarian",
      "description": "A specialized helmet that enhances a Space Marine Librarian's ability to detect and counter enemy psychic attacks."
    },
    {
      "name": "Nemesis Force Weapon",
      "type": "Psychic Weapon",
      "class": "Grey Knight",
      "description": "A specialized force weapon crafted for the Grey Knights, designed specifically for combating daemons and channeling their unique psychic abilities."
    },
    {
      "name": "Runestaff",
      "type": "Psychic Focus",
      "class": "Psyker",
      "description": "An ancient staff inscribed with complex runes that help stabilize warp energies, reducing the risk of perils of the warp."
    },
    {
      "name": "Null Rod",
      "type": "Anti-Psyker",
      "class": "Inquisitor",
      "description": "A rare device that creates a zone of psychic nullification, preventing the use of psychic powers in its vicinity."
    }
  ],
  "psykers": [
    {
      "name": "Mephiston",
      "type": "Space Marine Librarian",
      "description": "Lord of Death, Chief Librarian of the Blood Angels. One of the most powerful psykers in the Imperium who overcame the Black Rage."
    },
    {
      "name": "Tigurius",
      "type": "Space Marine Librarian",
      "description": "Chief Librarian of the Ultramarines, renowned for his prophetic abilities and said to be the strongest psyker in the Astartes."
    },
    {
      "name": "Ahriman",
      "type": "Chaos Sorcerer",
      "description": "Former Chief Librarian of the Thousand Sons, now a powerful Chaos sorcerer seeking the Black Library."
    },
    {
      "name": "Ezekiel",
      "type": "Space Marine Librarian",
      "description": "Grand Master of Librarians of the Dark Angels, keeper of ancient secrets and wielder of the Book of Salvation."
    },
    {
      "name": "Malcador the Sigillite",
      "type": "Human Psyker",
      "description": "The Emperor's right hand during the Great Crusade and Horus Heresy, one of the most powerful human psykers in history."
    },
    {
      "name": "Magnus the Red",
      "type": "Primarch",
      "description": "The crimson Primarch of the Thousand Sons Legion, a being of immense psychic power who fell to Chaos."
    }
  ],
  "battles": [
    {
      "name": "The Battle of Prospero",
      "type": "Historic Battle",
      "description": "The devastating assault on the Thousand Sons homeworld that marked a tragic turning point in the Horus Heresy."
    },
    {
      "name": "The Emperor vs. Horus",
      "type": "Historic Battle",
      "description": "The final confrontation between the Emperor of Mankind and his fallen son Horus aboard the Vengeful Spirit."
    },
    {
      "name": "The Psychneuein Infestation of Sarosh",
      "type": "Psychic Threat",
      "description": "A major psychic infestation where Grey Knights battled warp creatures that laid eggs in psykers' brains."
    },
    {
      "name": "The First War for Armageddon",
      "type": "Daemonic Incursion",
      "description": "Where the Grey Knights and Space Wolves fought against Angron and his Bloodthirsters, showcasing titanic psychic battles."
    }
  ],
  "psychicPowers": [
    {
      "name": "Smite",
      "discipline": "Divination",
      "warpCharge": "5+",
      "range": "18\"",
      "description": "The psyker hurls a bolt of raw psychic energy at the nearest visible enemy unit, inflicting D3 mortal wounds. If the result of the Psychic test is 11+, the target suffers D6 mortal wounds instead.",
      "users": ["Most Sanctioned Psykers", "Primaris Psykers", "Astropaths", "Space Marine Librarians"]
    },
    {
      "name": "Prescience",
      "discipline": "Divination",
      "warpCharge": "7",
      "range": "18\"",
      "description": "The psyker glimpses the threads of destiny, granting a friendly unit within range the ability to re-roll hit rolls of 1 until the start of your next Psychic phase.",
      "users": ["Farseer Eldrad Ulthran", "Imperial Primaris Psykers", "Navigator Houses"]
    },
    {
      "name": "The Red Thirst",
      "discipline": "Pyromancy",
      "warpCharge": "8",
      "range": "18\"",
      "description": "The psyker conjures roaring warp-fire that engulfs an enemy unit. The target suffers D6 mortal wounds. If a model is slain by this power, roll a D6 for each other model in the unit; on a 6, that model suffers 1 mortal wound as the flames spread.",
      "users": ["Thousand Sons Sorcerers", "Tzeentch-aligned Chaos Psykers"]
    }
  ]
}